app/controllers/web/admin/videos_controller.rb

SELECT  "videos".* FROM "videos"  LIMIT 100 OFFSET 0
SELECT COUNT(*) FROM "videos"
---
  def index
    @q = Video.ransack(params[:q])
    @videos = @q.result.page(params[:page]).per(app_config.pagination[:per_page])

SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = $1 LIMIT 1  [["id", 5]]
---
  def edit
    @video = Video.find(params[:id])

INSERT INTO "videos" ("created_at", "description", "slug", "sourcecode", "state", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2014-08-01 15:04:30.227271"], ["description", ""], ["slug", "Slug3"], ["sourcecode", ""], ["state", "active"], ["title", "Title2"], ["updated_at", "2014-08-01 15:04:30.227271"]]
---
  def create
    @video = VideoEditType.new(params[:video])

    if @video.save

UPDATE "videos" SET "description" = $1, "slug" = $2, "sourcecode" = $3, "title" = $4, "updated_at" = $5 WHERE "videos"."id" = 5  [["description", ""], ["slug", ""], ["sourcecode", ""], ["title", "Title"], ["updated_at", "2014-08-01 14:59:14.753186"]]
---
  def update
    @video = VideoEditType.find(params[:id])
    if @video.update(params[:video])

SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = $1 LIMIT 1  [["id", 5]]
---
  def destroy
    video = Video.find(params[:id])