app/controllers/videos_controller.rb

  def index
    @videos = Video.page params[:page]
---
SELECT  "videos".* FROM "videos"  LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "videos"